package basic;
	
//switch : 값을 비교하여 명령 선택 실행 - 실수값 제외
//형식) switch(비교대상) {
//			case 값1: 명령; 명령; ...[break;]
//			case 값2: 명령; 명령; ...[break;]
//			case 값3: 명령; 명령; ...[break;]
//			...
//			[default: 명령; 명령; ...]
//
// => 비교대상에는 변수 또는 연산식을 작성하여 비교하고자 하는 값 제공
// => 비교대상의 값을 case에 작성된 값과 차례대로 비교하여 같은 경우 해당 위치로부터 작성된
// 모든 명령 실행
// => case 키워드로 제공되는 값은 리터럴 또는 상수(Constant)만 작성 가능
// => case 키워드로 제공되는 값이 중복될 경우 에러 발생
// => break 키워드를 만나면 switch 구문 강제 종료 


public class SwitchApp {

}
